<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Маппинги для интеграции с RetailCRM
    |--------------------------------------------------------------------------
    |
    | Данный конфигурационный файл используется для отображения значений Defect
    | вашего приложения на соответствующие символьные коды, ожидаемые RetailCRM.
    | Эти соответствия обеспечивают синхронизацию между вашим приложением и RetailCRM.
    |
    */

    'mappings' => [

        /*
        |--------------------------------------------------------------------------
        | Пользовательское поле "Где товар"
        |--------------------------------------------------------------------------
        |
        | Здесь вы можете определить отображения для местоположений товара в вашем приложении
        | на соответствующие символьные коды, ожидаемые RetailCRM.
        |
        */
        'tovar_zabran' => [
            ['id' => 0, 'name' => "Нет", 'symbolic_code' => 'net'],
            ['id' => 1, 'name' => "В офисе", 'symbolic_code' => 'da'],
            ['id' => 2, 'name' => "У курьера", 'symbolic_code' => 'da-kyrer'],
            ['id' => 3, 'name' => "Частично - Офис/Курьер", 'symbolic_code' => 'chsctichno'],
            ['id' => 4, 'name' => "Частично - Офис/Поставщик", 'symbolic_code' => 'chscticnopost'],
            ['id' => 5, 'name' => "Частично - Поставщик/Курьер", 'symbolic_code' => 'chastichno-postavschik-kurer'],
            ['id' => 6, 'name' => "Вернули поставщику", 'symbolic_code' => 'vernuli'],
            ['id' => 7, 'name' => "Передан в СЦ", 'symbolic_code' => 'v-sc'],
            ['id' => 8, 'name' => "В ТК", 'symbolic_code' => 'da-v-tk'],
        ],

        /*
        |--------------------------------------------------------------------------
        | Пользовательское поле "Тип возврата"
        |--------------------------------------------------------------------------
        |
        | Здесь вы можете определить отображения для типов возврата в вашем приложении
        | на соответствующие символьные коды, ожидаемые RetailCRM.
        |
        */
        'vozvrat_tovara' => [
            ['id' => 0, 'name' => "Поставщику", 'symbolic_code' => 'postavshiku'],
            ['id' => 1, 'name' => "На склад", 'symbolic_code' => 'na-sklad'],
            ['id' => 2, 'name' => "Возврат брак", 'symbolic_code' => 'vozvrat-brak'],
        ],

        /*
        |--------------------------------------------------------------------------
        | Пользовательское поле "Тип замены"
        |--------------------------------------------------------------------------
        |
        | Здесь вы можете определить отображения для типов замены в вашем приложении
        | на соответствующие символьные коды, ожидаемые RetailCRM.
        |
        */
        'tip_zameny' => [
            ['id' => 0, 'name' => "С выкупом", 'symbolic_code' => 'zamena-s-vykupom'],
            ['id' => 1, 'name' => "Без выкупа", 'symbolic_code' => 'zamena-bez-vykupa'],
            ['id' => 2, 'name' => "Ремонт", 'symbolic_code' => 'remont-tovara'],
        ],

        /*
        |--------------------------------------------------------------------------
        | Пользовательское поле "Возврат товара"
        |--------------------------------------------------------------------------
        |
        | Здесь вы можете определить отображения для статусов возврата в вашем приложении
        | на соответствующие символьные коды, ожидаемые RetailCRM.
        |
        */
        'vozvrat_tovaraa' => [
            ['id' => 0, 'name' => "Не завершён", 'symbolic_code' => 'zaplaniro'],
            ['id' => 1, 'name' => "Завершён", 'symbolic_code' => 'sdelan'],
        ],
    ],

    'retailcrm' => [
        'url' => env('CRM_URL'),
        'token' => env('CRM_TOKEN'),
    ],
];
